# BarModelDiameter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBendData..::..BarModelDiameter Property
RebarBendData Class See Also
---
Defines the model diameter of the bar.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double BarModelDiameter { get; set; }
```

Visual Basic
---
```text
Public Property BarModelDiameter As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double BarModelDiameter {
	double get ();
	void set (double value);
}
```

# See Also
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace